{
  "base_model_name_or_path": "../baseline_models/gpt2-german-oscar/CAUSAL_LM",
  "bias": "none",
  "fan_in_fan_out": true,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "c_attn"
  ],
  "task_type": "CAUSAL_LM"
}